app/controllers/articles_controller.rb

  def create  ## the create action is inserting the form data to DB.
    @article = Article.new
    @article.title = params[:title]
    @article.description = params[:description]
    @article.save
---
INSERT INTO "articles" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "My article title"], ["description", "My article description"], ["created_at", "2020-09-16 00:40:56.383042"], ["updated_at", "2020-09-16 00:40:56.383042"]]